In [1]:
import numpy as np
import pandas as pd

In [2]:
d = pd.DataFrame([12,35,2.6,4.5,5.8,9.7])
d

      0
0  12.0
1  35.0
2   2.6
3   4.5
4   5.8
5   9.7

In [3]:
d.dtypes

0    float64
dtype: object

In [4]:
d = pd.DataFrame([12,35,2.6,4.5,5.8,9.7],dtype='int')
d

C:\Users\hakim\AppData\Local\Temp/ipykernel_7644/1255712123.py:1: FutureWarning: In a future version, passing float-dtype values and an integer dtype to DataFrame will retain floating dtype if they cannot be cast losslessly (matching Series behavior). To retain the old behavior, use DataFrame(data).astype(dtype)
  d = pd.DataFrame([12,35,2.6,4.5,5.8,9.7],dtype='int')

    0
0  12
1  35
2   2
3   4
4   5
5   9

In [5]:
d.dtypes

0    int32
dtype: object

In [ ]:
d

## astype

In [6]:
e = d.astype('float32')
e

      0
0  12.0
1  35.0
2   2.0
3   4.0
4   5.0
5   9.0

In [7]:
e.dtypes

0    float32
dtype: object

In [13]:
e #dtype is float

      0
0  12.0
1  35.0
2   2.0
3   4.0
4   5.0
5   9.0

In [14]:
np.array(e).ravel()

array([12., 35.,  2.,  4.,  5.,  9.], dtype=float32)

In [16]:
pd.to_numeric(np.array(e).ravel(),downcast='integer')

array([12, 35,  2,  4,  5,  9], dtype=int8)

In [18]:
#usecase
a = pd.DataFrame(['1','2','3'])
a

   0
0  1
1  2
2  3

In [19]:
a.dtypes

0    object
dtype: object

In [20]:
a.astype('int')

   0
0  1
1  2
2  3

In [21]:
e.astype('int32')

    0
0  12
1  35
2   2
3   4
4   5
5   9

# Conditional selection

In [22]:
d

    0
0  12
1  35
2   2
3   4
4   5
5   9

In [23]:
#if we apply some condition then it results in bool output
d>3

       0
0   True
1   True
2  False
3   True
4   True
5   True

In [24]:
d[0]>3

0     True
1     True
2    False
3     True
4     True
5     True
Name: 0, dtype: bool

In [25]:
d[d>3]#using dataframe directly as an index
#NaN Not a number

      0
0  12.0
1  35.0
2   NaN
3   4.0
4   5.0
5   9.0

In [26]:
d[d[0]>3] #using Series

    0
0  12
1  35
3   4
4   5
5   9

## where

In [27]:
d>3

       0
0   True
1   True
2  False
3   True
4   True
5   True

In [28]:
#Replace values where the condition is False.
d.where(d>3)

      0
0  12.0
1  35.0
2   NaN
3   4.0
4   5.0
5   9.0

In [29]:
d.where(d[0]>3)
#where the condition is false there u will get NaN

      0
0  12.0
1  35.0
2   NaN
3   4.0
4   5.0
5   9.0

In [30]:
d.where(d[0]>3,0) #if we want to fill other values instead of nan then we can put like this
# so where the condition is False u will get 0

    0
0  12
1  35
2   0
3   4
4   5
5   9

In [31]:
d.mean()

0    11.166667
dtype: float64

In [42]:
d[0].mean()

11.166666666666666

In [41]:
d.where(d[0]>3,d[0].mean())

           0
0  12.000000
1  35.000000
2  11.166667
3   4.000000
4   5.000000
5   9.000000

In [39]:
round(12.545556,3)

12.546

In [35]:
d.where(d[0]>3,round(d[0].mean(),2))

       0
0  12.00
1  35.00
2  11.17
3   4.00
4   5.00
5   9.00

In [44]:
d.where(d<3,-d)
# in above case we are trying to make values negative where condition is False

    0
0 -12
1 -35
2   2
3  -4
4  -5
5  -9

In [45]:
f = pd.DataFrame(np.random.rand(4,4))
f

          0         1         2         3
0  0.601066  0.916021  0.550982  0.841418
1  0.437612  0.533195  0.862054  0.122458
2  0.491947  0.226045  0.488184  0.945639
3  0.547273  0.318650  0.699942  0.575024

In [46]:
f.where(f>0.5)

          0         1         2         3
0  0.601066  0.916021  0.550982  0.841418
1       NaN  0.533195  0.862054       NaN
2       NaN       NaN       NaN  0.945639
3  0.547273       NaN  0.699942  0.575024

In [47]:
f[0].mean()

0.5194742781288031

In [50]:
f.mean()

0    0.519474
1    0.498478
2    0.650290
3    0.621135
dtype: float64

In [49]:
f.where(f>0.5,f.mean(),axis=0)

          0         1         2         3
0  0.601066  0.916021  0.550982  0.841418
1  0.498478  0.533195  0.862054  0.498478
2  0.650290  0.650290  0.650290  0.945639
3  0.547273  0.621135  0.699942  0.575024

### mask

In [52]:
#mask is exactly opposite of where
#means mask will make NaN whre condition is True and will get Values wher condition is False
f

          0         1         2         3
0  0.601066  0.916021  0.550982  0.841418
1  0.437612  0.533195  0.862054  0.122458
2  0.491947  0.226045  0.488184  0.945639
3  0.547273  0.318650  0.699942  0.575024

In [53]:
f[0]>.5

0     True
1    False
2    False
3     True
Name: 0, dtype: bool

In [54]:
f[0].mask(f[0]>.5)

0         NaN
1    0.437612
2    0.491947
3         NaN
Name: 0, dtype: float64

In [55]:
f[[0]].mask(f[[0]]>.5)

          0
0       NaN
1  0.437612
2  0.491947
3       NaN

In [56]:
f[[1,3]].mask(f[[1,3]]>.5)

          1         3
0       NaN       NaN
1       NaN  0.122458
2  0.226045       NaN
3  0.318650       NaN

In [57]:
f[[1,3]].mask(f[[1,3]]>.5,0)

          1         3
0  0.000000  0.000000
1  0.000000  0.122458
2  0.226045  0.000000
3  0.318650  0.000000

In [58]:
f[[1,3]].mask(f[[1,3]]>.5,-f[[1,3]])

          1         3
0 -0.916021 -0.841418
1 -0.533195  0.122458
2  0.226045 -0.945639
3  0.318650 -0.575024